# coding: utf-8

BOOKS_DB = {
# ТРИЛЛЕР
"Гиллиан Флинн": [
{"title": "Исчезнувшая"},
{"title": "Острые предметы"},
{"title": "Тёмные тайны"},
],
"Паула Хокинс": [
{"title": "Девушка в поезде"},
{"title": "В тихом омуте"},
{"title": "Медленный огонь"},
],
"Харлан Кобен": [
{"title": "Не говори никому"},
{"title": "Лес"},
{"title": "Шесть лет спустя"},
],
"Майк Омер": [
{"title": "Внутри убийцы"},
{"title": "Заживо в темноте"},
{"title": "Глазами жертвы"},
],
"Герритсен Тесс": [
{"title": "Хирург"},
{"title": "Ученик"},
{"title": "Грешница"},
{"title": "Гиблое место"},
{"title": "Смертницы"},
],
"Франк Тилье": [
{"title": "Головокружение"},
{"title": "Головоломка"},
{"title": "Преломы"},
{"title": "Пандемия"},
{"title": "Сновидение"},
],
"Стиг Ларссон": [
{"title": "Девушка с татуировкой дракона"},
{"title": "Девушка, которая играла с огнём"},
{"title": "Девушка, которая взрывала воздушные замки"},
],
"Жан-Кристоф Гранже": [
{"title": "Багровые реки"},
{"title": "Лонтано"},
{"title": "Конго Реквием"},
],

# ЗАРУБЕЖНЫЙ ДЕТЕКТИВ
"Агата Кристи": [
{"title": "Убийство в Восточном экспрессе"},
{"title": "Смерть на Ниле"},
{"title": "Десять негритят"},
],
"Артур Конан Дойл": [
{"title": "Собака Баскервилей"},
{"title": "Этюд в багровых тонах"},
{"title": "Знак четырёх"},
],
"Жорж Сименон": [
{"title": "Мегрэ и мёртвый в доме"},
{"title": "Мегрэ и человек на скамейке"},
{"title": "Мегрэ и призрак"},
],
"Энн Кливз": [
{"title": "Немые голоса"},
{"title": "Скрытые глубины"},
{"title": "Рассказывая сказки"},
{"title": "Снежное забвение"},
{"title": "Черный ворон"},
{"title": "Комната из стекла"},
{"title": "Тихая ночь"},
],
"Роберт Гэлбрейт": [
{"title": "Зов кукушки"},
{"title": "Шелкопряд"},
{"title": "На службе зла"},
{"title": "Случайная вакансия"},
{"title": "Чернильно-черное сердце"},
{"title": "Смертельная белизна"},
{"title": "Дурная кровь"},
],
"Ю Несбё": [
{"title": "Снеговик"},
{"title": "Красношейка"},
{"title": "Тараканы"},
{"title": "Жажда"},
{"title": "Леопард"},
{"title": "Спаситель"},
{"title": "Пентаграма"},
],
"Камилла Лэгберг": [
{"title": "Ледяная принцесса"},
{"title": "Проповедник"},
{"title": "Вкус пепла"},
{"title": "Ведьма"},
{"title": "Укрощение"},
{"title": "Призрачный маяк"},
],
"Роберт Брындза": [
{"title": "Темные воды"},
{"title": "Ночной охотник"},
{"title": "Девушка во льду"},
{"title": "Последнее дыхание"},
{"title": "Смертельные тайны"},
{"title": "Холодная кровь"},
{"title": "Девять вязов"},
{"title": "Черные пески"},
{"title": "Тьма падет"},
],
"Жоэль Диккер": [
{"title": "Правда о деле Гарри Квеберта"},
{"title": "Дело Аляски Сандерс"},
{"title": "Книга Балтиморов"},
{"title": "Дикий зверь"},
],


# ФАНТАСТИКА
"Рэй Брэдбери": [
{"title": "451 градус по Фаренгейту"},
{"title": "Марсианские хроники"},
{"title": "Вино из одуванчиков"},
{"title": "Надвигается беда"},
{"title": "Темный карнавал"},
{"title": "Лето прощай"},
],
"Айзек Азимов": [
{"title": "Основание"},
{"title": "Я, робот"},
{"title": "Конец Вечности"},
],
"Филип Дик": [
{"title": "Мечтают ли андроиды об электроовцах?"},
{"title": "Человек в высоком замке"},
{"title": "Убик"},
],
"Роберт Ханлайн": [
{"title": "Звездный десант"},
{"title": "Дверь в лето"},
{"title": "Пасынки Вселенной"},
{"title": "Туннель в небе"},
{"title": "Кукловоды"},
{"title": "Гражданин галактики"},
],
"Сергей Лукьяненко": [
{"title": "Спектр"},
{"title": "Квази"},
{"title": "Ночной дозор"},
{"title": "Мальчик и тьма"},
{"title": "Черновик"},
{"title": "Лабиринт отражений"},
{"title": "Рыцари сорока островов"},
{"title": "Линия грез"},
{"title": "Геном"},
],
"Кир Булычев": [
{"title": "Поселок"},
{"title": "Любимец"},
{"title": "Последняя война"},
{"title": "Сто лет тому вперед"},
{"title": "Смерть этажом ниже"},
{"title": "Город наверху"},
],
"Дэн Симмонс": [
{"title": "Гиперион"},
{"title": "Лето ночи"},
{"title": "Террор"},
{"title": "Песнь Кали"},
{"title": "Мерзость"},
],
"Дмитрий Глуховский": [
{"title": "Сумерки"},
{"title": "Пост"},
{"title": "Будущее"},
{"title": "Текст"},
{"title": "Метро"},
],

# ХОРРОР
"Стивен Кинг": [
{"title": "Сияние"},
{"title": "Оно"},
{"title": "Мизери"},
{"title": "Противостояние"},
{"title": "Под Куполом"},
{"title": "Стрелок"},
{"title": "Сердца в Атлантиде"},
{"title": "Извлечение троих"},
{"title": "Бесплодные земли"},
{"title": "Колдун и кристалл"},
{"title": "Волки Кальи"},
{"title": "Песнь Сюзанны"},
{"title": "Темная башня"},
{"title": "Под куполом"},
{"title": "11.22.63"},
{"title": "Игра Джералда"},
{"title": "Блейз"},
],
"Говард Лавкрафт": [
{"title": "Зов Ктулху"},
{"title": "Тень над Иннсмутом"},
{"title": "Хребты безумия"},
],

"Клайв Баркер": [
{"title": "Книги крови"},
{"title": "Адский рай"},
{"title": "Игры разума"},
],

"Роберт Рик Маккаммон": [
{"title": "Они жаждут"},
{"title": "Жизнь мальчишки"},
{"title": "Голос ночной птицы"},
{"title": "Королева Бедлама"},
{"title": "Песня Свон"},
],
"Андрей Подшибякин": [
{"title": "Последний день лета"},
],
"Дарья Бобылева": [
{"title": "Вьюрки"},
{"title": "Наш двор"},
{"title": "Забытый человек"},
],
"Константин Образцов": [
{"title": "Красные цепи"},
{"title": "Молот ведьм"},
{"title": "Культ"},
],
"Анна Старобинец": [
{"title": "Посмотри на него"},
{"title": "Лисьи броды"},
{"title": "Посмотри на него"},
{"title": "В логове волка"},
],



# РУССКИЙ ДЕТЕКТИВ
"Борис Акунин": [
{"title": "Азазель"},
{"title": "Турецкий гамбит"},
{"title": "Левиафан"},
{"title": "Нефритовые четки"},
{"title": "Алмазная колесница"},
],
"Татьяна Устинова": [
{"title": "Большое зло и мелкие пакости"},
{"title": "Персональный ангел"},
{"title": "Мой генерал"},
],
"Александра Маринина": [
{"title": "Стечение обстоятельств"},
{"title": "Игра на чужом поле"},
{"title": "Смерть и немного любви"},
{"title": "Тот, кто знает"},
{"title": "Украденный сон"},
],
"Елена Михалкова": [
{"title": "Лягушачий король"},
{"title": "Посмотри, отвернись, посмотри"},
{"title": "Нежные листья, ядовитые корни"},
],
"Андрей Константинов": [
{"title": "Адвокат"},
{"title": "Журналист"},
{"title": "Судья"},
],
"Полина Дашкова": [
{"title": "Источник счастья"},
{"title": "Легкие шаги безумия"},
{"title": "Вечная ночь"},
{"title": "Кровь нерожденных"},
{"title": "Место под солнцем"},
{"title": "Приз"},
{"title": "Горлов тупик"},
{"title": "Херувим"},
{"title": "Золотой песок"},
],

# РУССКАЯ КЛАССИКА
"Фёдор Достоевский": [
{"title": "Преступление и наказание"},
{"title": "Идиот"},
{"title": "Братья Карамазовы"},
],
"Лев Толстой": [
{"title": "Война и мир"},
{"title": "Анна Каренина"},
{"title": "Воскресение"},
],
"Николай Гоголь": [
{"title": "Мёртвые души"},
{"title": "Ревизор"},
{"title": "Вий"},
],
"Александр Куприн": [
{"title": "Яма"},
{"title": "Гранатовый браслет"},
{"title": "Поединок"},
],
"Михаил Булгаков": [
{"title": "Мастер и Маргарита"},
{"title": "Собачье сердце"},
{"title": "Записки юного врача"},
{"title": "Морфий"},
],

# ЗАРУБЕЖНАЯ КЛАССИКА
"Чарльз Диккенс": [
{"title": "Большие надежды"},
{"title": "Оливер Твист"},
{"title": "Рождественская песнь"},
],
"Джейн Остин": [
{"title": "Гордость и предубеждение"},
{"title": "Разум и чувства"},
{"title": "Эмма"},
],
"Эмиль Золя": [
{"title": "Тереза Ракен"},
{"title": "Жерминаль"},
{"title": "Нана"},
],
"Джон Стейнбек": [
{"title": "К востоку от рая"},
{"title": "Гроздья гнева"},
{"title": "О мышах и людях"},
{"title": "Жемчужина"},
{"title": "Путешествие Чарли в поисках Америки"},
],
"Уильям Фолкнер": [
{"title": "Звук и ярость"},
{"title": "Свет в августе"},
{"title": "Когда я умирала"},
],
"Марк Твен": [
{"title": "Приключения Тома Сойера"},
{"title": "Приключения Гекльберри Финна"},
{"title": "Принц и нищий"},
],
"Виктор Гюго": [
{"title": "Отверженные"},
{"title": "Собор Парижской Богоматери"},
{"title": "Человек, который смеется"},
],

# СОВРЕМЕННАЯ ПРОЗА
"Харуки Мураками": [
{"title": "Норвежский лес"},
{"title": "Кафка на пляже"},
{"title": "1Q84"},
],
"Джонатан Франзен": [
{"title": "Поправки"},
{"title": "Свобода"},
{"title": "Чистота"},
],
"Иэн Макьюэн": [
{"title": "Искупление"},
{"title": "Цементный сад"},
{"title": "Суббота"},
{"title": "На берегу"},
{"title": "Амстердам"},
],
"Джонотан Троппер": [
{"title": "Дальше живите сами"},
{"title": "На прощанье я скажу"},
{"title": "Книга Джо"},
],
"Алексей Поляринов": [
{"title": "Кадавры"},
{"title": "Риф"},
{"title": "Центр тяжести"},
],
"Роман Сечин": [
{"title": "Елтышевы"},
{"title": "Зона затопления"},
{"title": "Дождь в Париже"},
],
"Иэн Бэнкс": [
{"title": "Воронья дорога"},
{"title": "Осинная фабрика"},
{"title": "Песнь камня"},
{"title": "Шаги по стеклу"},
{"title": "Улица отчаяния"},
{"title": "Мост"},
],
"Алексей Иванов": [
{"title": "Сердце Пармы"},
{"title": "Географ глобус пропил"},
{"title": "Ненастье"},
{"title": "Бронепараходы"},
{"title": "Вегетация"},
{"title": "Псоглавцы"},
{"title": "Тобол"},
],
"Донна Тартт": [
{"title": "Тайная история"},
{"title": "Щегол"},
{"title": "Маленький друг"},
],
"Яна Вагнер": [
{"title": "Вонгозеро"},
{"title": "Живые люди"},
{"title": "Кто не спрятался"},
{"title": "Тоннель"},
],
}


GENRES = {
"триллер": ["Гиллиан Флинн", "Паула Хокинс", "Харлан Кобен", "Майк Омер", "Герритсен Тесс", "Франк Тилье", "Стиг Ларссон", "Жан-Кристоф Гранже"],
"зарубежный детектив": ["Агата Кристи", "Артур Конан Дойл", "Жорж Сименон", "Энн Кливз", "Роберт Гелбрейт", "Камилла Лэгберг", "Роберт Брындза", "Жоэль Диккер"],
"фантастика": ["Рэй Брэдбери", "Айзек Азимов", "Филип Дик", "Роберт Ханлайн", "Сергей Лукьяненко", "Кир Булычев", "Дэн Симмонс", "Дмитрий Глуховский"],
"хоррор": ["Стивен Кинг", "Говард Лавкрафт", "Клайв Баркер", "Роберт Рик Маккаммон", "Андрей Подшибякин", "Дарья Бобылева", "Константин Образцов", "Анна Старобинец"],
"русский детектив": ["Борис Акунин", "Татьяна Устинова", "Александра Маринина", "Елена Михалкова", "Андрей Константинов", "Полина Дашкова",],
"русская классика": ["Фёдор Достоевский", "Лев Толстой", "Николай Гоголь", "Александр Куприн", "Михаил Булгаков"],
"зарубежная классика": ["Чарльз Диккенс", "Джейн Остин", "Эмиль Золя", "Джон Стейнбек", "Уильям Фолкнер", "Марк Твен", "Виктор Гюго"],
"современная проза": ["Харуки Мураками", "Джонатан Франзен", "Иэн Макьюэн", "Джонотан Троппер", "Алексей Поляринов", "Роман Сечин", "Иэн Бэнкс", "Алексей Иванов", "Донна Тартт", "Яна Вагнер" ],
}
