# coding: utf-8

BOOKS_DB = {
    # ТРИЛЛЕР
    "Гиллиан Флинн": [
        {"title": "Исчезнувшая"},
        {"title": "Острые предметы"},
        {"title": "Тёмные тайны"},
    ],
    "Паула Хокинс": [
        {"title": "Девушка в поезде"},
        {"title": "В тихом омуте"},
        {"title": "Медленный огонь"},
    ],
    "Харлан Кобен": [
        {"title": "Не говори никому"},
        {"title": "Лес"},
        {"title": "Шесть лет спустя"},
    ],
    "Майк Омер": [
        {"title": "Внутри убийцы"},
        {"title": "Заживо в темноте"},
        {"title": "Глазами жертвы"},
    ],
    "Герритсен Тесс": [
        {"title": "Хирург"},
        {"title": "Ученик"},
        {"title": "Грешница"},
    ],

    # ЗАРУБЕЖНЫЙ ДЕТЕКТИВ
    "Агата Кристи": [
        {"title": "Убийство в Восточном экспрессе"},
        {"title": "Смерть на Ниле"},
        {"title": "Десять негритят"},
    ],
    "Артур Конан Дойл": [
        {"title": "Собака Баскервилей"},
        {"title": "Этюд в багровых тонах"},
        {"title": "Знак четырёх"},
    ],
    "Жорж Сименон": [
        {"title": "Мегрэ и мёртвый в доме"},
        {"title": "Мегрэ и человек на скамейке"},
        {"title": "Мегрэ и призрак"},
    ],
    "Энн Кливз": [
        {"title": "Немые голоса"},
        {"title": "Скрытые глубины"},
        {"title": "Рассказывая сказки"},
    ],
    "Роберт Гэлбрейт": [
        {"title": "Зов кукушки"},
        {"title": "Шелкопряд"},
        {"title": "На службе зла"},
    ],
    "Ю Несбё": [
        {"title": "Снеговик"},
        {"title": "Красношейка"},
        {"title": "Тараканы"},
    ],


    # ФАНТАСТИКА
    "Рэй Брэдбери": [
        {"title": "451 градус по Фаренгейту"},
        {"title": "Марсианские хроники"},
        {"title": "Вино из одуванчиков"},
    ],
    "Айзек Азимов": [
        {"title": "Основание"},
        {"title": "Я, робот"},
        {"title": "Конец Вечности"},
    ],
    "Филип Дик": [
        {"title": "Мечтают ли андроиды об электроовцах?"},
        {"title": "Человек в высоком замке"},
        {"title": "Убик"},
    ],
    "Роберт Ханлайн": [
        {"title": "Звездный десант"},
        {"title": "Дверь в лето"},
        {"title": "Пасынки Вселенной"},
    ],
    "Сергей Лукьяненко": [
        {"title": "Спектр"},
        {"title": "Квази"},
        {"title": "Ночной дозор"},
        {"title": "Мальчик и тьма"},
        {"title": "Черновик"}
    ],
    "Кир Булычев": [
        {"title": "Поселок"},
        {"title": "Любимец"},
        {"title": "Последняя война"},
    ],

    # ХОРРОР
    "Стивен Кинг": [
        {"title": "Сияние"},
        {"title": "Оно"},
        {"title": "Мизери"},
        {"title": "Противостояние"},
        {"title": "Под Куполом"},
        {"title": "Стрелок"},
        {"title": "Сердца в Атлантиде"},
    ],
    "Говард Лавкрафт": [
        {"title": "Зов Ктулху"},
        {"title": "Тень над Иннсмутом"},
        {"title": "Хребты безумия"},
    ],

    "Клайв Баркер": [
        {"title": "Книги крови"},
        {"title": "Адский рай"},
        {"title": "Игры разума"},
    ],

    "Роберт Рик Маккаммон": [
        {"title": "Они жаждут"},
        {"title": "Жизнь мальчишки"},
        {"title": "Голос ночной птицы"},
        {"title": "Королева Бедлама"},
        {"title": "Песня Свон"},
    ],
    "Андрей Подшибякин": [
        {"title": "Последний день лета"},
    ],
    "Дарья Бобылева": [
        {"title": "Вьюрки"},
        {"title": "Наш двор"},
        {"title": "Забытый человек"},
    ],



    # РУССКИЙ ДЕТЕКТИВ
    "Борис Акунин": [
        {"title": "Азазель"},
        {"title": "Турецкий гамбит"},
        {"title": "Левиафан"},
        {"title": "Нефритовые четки"},
        {"title": "Алмазная колесница"},
    ],
    "Татьяна Устинова": [
        {"title": "Большое зло и мелкие пакости"},
        {"title": "Персональный ангел"},
        {"title": "Мой генерал"},
    ],
    "Александра Маринина": [
        {"title": "Стечение обстоятельств"},
        {"title": "Игра на чужом поле"},
        {"title": "Смерть и немного любви"},
        {"title": "Тот, кто знает"},
        {"title": "Украденный сон"},
    ],

    # РУССКАЯ КЛАССИКА
    "Фёдор Достоевский": [
        {"title": "Преступление и наказание"},
        {"title": "Идиот"},
        {"title": "Братья Карамазовы"},
    ],
    "Лев Толстой": [
        {"title": "Война и мир"},
        {"title": "Анна Каренина"},
        {"title": "Воскресение"},
    ],
    "Николай Гоголь": [
        {"title": "Мёртвые души"},
        {"title": "Ревизор"},
        {"title": "Вий"},
    ],
    "Александр Куприн": [
        {"title": "Яма"},
        {"title": "Гранатовый браслет"},
        {"title": "Поединок"},
    ],
    "Михаил Булгаков": [
        {"title": "Мастер и Маргарита"},
        {"title": "Собачье сердце"},
        {"title": "Записки юного врача"},
        {"title": "Морфий"},
    ],

    # ЗАРУБЕЖНАЯ КЛАССИКА
    "Чарльз Диккенс": [
        {"title": "Большие надежды"},
        {"title": "Оливер Твист"},
        {"title": "Рождественская песнь"},
    ],
    "Джейн Остин": [
        {"title": "Гордость и предубеждение"},
        {"title": "Разум и чувства"},
        {"title": "Эмма"},
    ],
    "Эмиль Золя": [
        {"title": "Тереза Ракен"},
        {"title": "Жерминаль"},
        {"title": "Нана"},
    ],
    "Джон Стейнбек": [
        {"title": "К востоку от рая"},
        {"title": "Гроздья гнева"},
        {"title": "О мышах и людях"},
        {"title": "Жемчужина"},
        {"title": "Путешествие Чарли в поисках Америки"},
    ],

    # СОВРЕМЕННАЯ ПРОЗА
    "Харуки Мураками": [
        {"title": "Норвежский лес"},
        {"title": "Кафка на пляже"},
        {"title": "1Q84"},
    ],
    "Джонатан Франзен": [
        {"title": "Поправки"},
        {"title": "Свобода"},
        {"title": "Чистота"},
    ],
    "Иэн Макьюэн": [
        {"title": "Искупление"},
        {"title": "Амстердам"},
        {"title": "Суббота"},
    ],
    "Джонотан Троппер": [
        {"title": "Дальше живите сами"},
        {"title": "На прощанье я скажу"},
        {"title": "Книга Джо"},
    ],
    "Алексей Поляринов": [
        {"title": "Кадавры"},
        {"title": "Риф"},
        {"title": "Центр тяжести"},
    ],
}

GENRES = {
    "триллер": ["Гиллиан Флинн", "Паула Хокинс", "Харлан Кобен", "Майк Омер", "Герритсен Тесс"],
    "зарубежный детектив": ["Агата Кристи", "Артур Конан Дойл", "Жорж Сименон", "Энн Кливз", "Роберт Гелбрейт"],
    "фантастика": ["Рэй Брэдбери", "Айзек Азимов", "Филип Дик", "Роберт Ханлайн", "Сергей Лукьяненко", "Кир Булычев"],
    "хоррор": ["Стивен Кинг", "Говард Лавкрафт", "Клайв Баркер", "Роберт Рик Маккаммон", "Андрей Подшибякин", "Дарья Бобылева"],
    "русский детектив": ["Борис Акунин", "Татьяна Устинова", "Александра Маринина", "Александр Куприн", "Михаил Булгаков"],
    "русская классика": ["Фёдор Достоевский", "Лев Толстой", "Николай Гоголь", "Александр Куприн", "Михаил Булгаков"],
    "зарубежная классика": ["Чарльз Диккенс", "Джейн Остин", "Эмиль Золя", "Джон Стейнбек"],
    "современная проза": ["Харуки Мураками", "Джонатан Франзен", "Иэн Макьюэн", "Джонотан Троппер", "Алексей Поляринов"],
}
